# TemperatureRatingTypeSetIterator Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSetIterator Constructor
TemperatureRatingTypeSetIterator Class See Also
---
For Internal Use Only.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TemperatureRatingTypeSetIterator()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TemperatureRatingTypeSetIterator()
```

# Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
# See Also
TemperatureRatingTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace